src/main/test/supply-chain/1-Grouping/0-Apply Tax/0-02_01_SUBCLASS-Grouping/3-TC02_01.04_GOODS_header_line_level_different_values/3-TC02_01.04_GOODS_header_line_level_different_values-4-CNEE/request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:ws="http://ws.tim.ikea.com/">
   <soap:Header/>
   <soap:Body>
      <ws:applyTax>
     <arg0>
				<DocumentId>
					<SystemSourceId>ICI001</SystemSourceId>
					<TransactionId/>
				</DocumentId>
				<AlternateDocumentId>
					<CustomField1>TEST</CustomField1>
					<CustomField2/>
					<CustomField3/>
					<CustomField4/>
					<CustomField5/>
					<CustomField6/>
					<CustomField7/>
					<CustomField8/>
					<CustomField9/>
					<CustomField10/>
				</AlternateDocumentId>
				<InvoiceLanguage>
					<LanguageCode/>
					<LanguageCountryCode/>
				</InvoiceLanguage>
				<CommunicationLanguage>
					<LanguageCode/>
					<LanguageCountryCode/>
				</CommunicationLanguage>
				<CalculationDecimalPlaces>5</CalculationDecimalPlaces>
				<PreviousInvoiceTaxCountry>DE</PreviousInvoiceTaxCountry>
				<TaxDecisionSet>
					<TaxDecisionSetId/>
					<SellerTaxIndicator>
						<TaxIndicatorAbbreviation/>
						<TaxIndicatorName/>
						<TaxIndicatorComment/>
					</SellerTaxIndicator>
					<SellerTaxCountry/>
					<SellerTaxState/>
					<BuyerTaxIndicator>
						<TaxIndicatorAbbreviation/>
						<TaxIndicatorName/>
						<TaxIndicatorComment/>
					</BuyerTaxIndicator>
					<BuyerTaxCountry/>
					<BuyerTaxState/>
					<CombinedTaxIndicator/>
					<CommercialIndicator/>
					<SellerTaxRegCountry/>
					<SellerTaxRegState/>
					<BuyerTaxRegCountry/>
					<BuyerTaxRegState/>
					
					<TaxComment>
						<TaxCommentType/>
						<TaxCommentText/>
					</TaxComment>
					<InvoiceCurrency>
						<CurrencyCode>EUR</CurrencyCode>
						
						<SellerLocalTaxCurrencyCode/>
						
						<BuyerLocalTaxCurrencyCode/>
					</InvoiceCurrency>
					<LegalTaxCalculationLevel/>
					<TaxInvoiceLine>
						<LineNumber>1</LineNumber>
						<ItemNo>70104103</ItemNo>
						<ItemType>ART</ItemType>
						<UNSPSC>56000000</UNSPSC>
						<Classification/>
						<SubClassification/>
						<CountryItemClassification/>
						<NetAmount>8.00</NetAmount>
						<VariableTaxSteeringInput>
							<ConsignorCountry/>
							<ConsignorState/>
							<ConsignorBusinessUnitCode/>
							<ConsignorBusinessUnitType/>
							<ConsigneeCountry/>
							<ConsigneeState/>
							<ConsigneeBusinessUnitCode>151</ConsigneeBusinessUnitCode>
							<ConsigneeBusinessUnitType>STO</ConsigneeBusinessUnitType>
							<CarrierCountry/>
							<CarrierState/>
							<CarrierBusinessUnitCode/>
							<CarrierBusinessUnitType/>
							<ShipmentStartCountry/>
							<ShipmentEndCountry/>
							<ShipmentStartState/>
							<ShipmentEndState/>
							<ServiceRenderedCountry/>
							<ServiceRenderedState/>
							<ResalePurpose/>
							<IsOutBonded/>
							<IsInBonded/>
							<TaxPreAlgorithmOutput>
								<IsExport/>
								<IsImport/>
								<IsExported/>
								<IsImported/>
							</TaxPreAlgorithmOutput>
							<ShippingOfCustomsClearedGoods/>
						</VariableTaxSteeringInput>
					</TaxInvoiceLine>
					<TaxInvoiceLine>
						<LineNumber>2</LineNumber>
						<ItemNo>13690607</ItemNo>
						<ItemType>ART</ItemType>
						<UNSPSC>56000000</UNSPSC>
						<Classification/>
						<SubClassification/>
						<CountryItemClassification/>
						<NetAmount>10.00</NetAmount>
						<VariableTaxSteeringInput>
							<ConsignorCountry/>
							<ConsignorState/>
							<ConsignorBusinessUnitCode/>
							<ConsignorBusinessUnitType/>
							<ConsigneeCountry/>
							<ConsigneeState/>
							<ConsigneeBusinessUnitCode>150</ConsigneeBusinessUnitCode>
							<ConsigneeBusinessUnitType>STO</ConsigneeBusinessUnitType>
							<CarrierCountry/>
							<CarrierState/>
							<CarrierBusinessUnitCode/>
							<CarrierBusinessUnitType/>
							<ShipmentStartCountry/>
							<ShipmentEndCountry/>
							<ShipmentStartState/>
							<ShipmentEndState/>
							<ServiceRenderedCountry/>
							<ServiceRenderedState/>
							<ResalePurpose/>
							<IsOutBonded/>
							<IsInBonded/>
							<TaxPreAlgorithmOutput>
								<IsExport/>
								<IsImport/>
								<IsExported/>
								<IsImported/>
							</TaxPreAlgorithmOutput>
							<ShippingOfCustomsClearedGoods/>
						</VariableTaxSteeringInput>
					</TaxInvoiceLine>
				</TaxDecisionSet>
				<TaxDate>
					<TaxAlgorithmDate>2013-02-01</TaxAlgorithmDate>
					<TaxCalculationDate/>
				</TaxDate>
				<TaxModuleBehaviour>
					<SkipCalculation>Y</SkipCalculation>
					<SkipDecision>N</SkipDecision>
				</TaxModuleBehaviour>
				<VariableTaxSteeringInput>
					<ConsignorCountry/>
					<ConsignorState/>
					<ConsignorBusinessUnitCode>22416</ConsignorBusinessUnitCode>
					<ConsignorBusinessUnitType>SUP</ConsignorBusinessUnitType>
					<ConsigneeCountry/>
					<ConsigneeState/>
					<ConsigneeBusinessUnitCode>278</ConsigneeBusinessUnitCode>
					<ConsigneeBusinessUnitType>STO</ConsigneeBusinessUnitType>
					<CarrierCountry/>
					<CarrierState/>
					<CarrierBusinessUnitCode/>
					<CarrierBusinessUnitType/>
					<ShipmentStartCountry/>
					<ShipmentEndCountry/>
					<ShipmentStartState/>
					<ShipmentEndState/>
					<ServiceRenderedCountry/>
					<ServiceRenderedState/>
					<ResalePurpose>Y</ResalePurpose>
					<IsOutBonded>N</IsOutBonded>
					<IsInBonded>N</IsInBonded>
					<TaxPreAlgorithmOutput>
						<IsExport>N</IsExport>
						<IsImport>N</IsImport>
						<IsExported>N</IsExported>
						<IsImported>N</IsImported>
					</TaxPreAlgorithmOutput>
					<ShippingOfCustomsClearedGoods/>
				</VariableTaxSteeringInput>
				<BuyerParty>
					<Party>
						<BusinessUnitCode>5430</BusinessUnitCode>
						<BusinessUnitType>COM</BusinessUnitType>
						<BusinessUnitName/>
						<PartyAddress>
							<AddressType/>
							<City/>
							<PostBox/>
							<Street/>
							<ZipCode/>
							<CountryCode/>
							<StateCode/>
							<CountryOfLegalRegistration/>
						</PartyAddress>
					</Party>
				</BuyerParty>
				<SellerParty>
					<Party>
						<BusinessUnitCode>5100</BusinessUnitCode>
						<BusinessUnitType>COM</BusinessUnitType>
						<BusinessUnitName/>
						<PartyAddress>
							<AddressType/>
							<City/>
							<PostBox/>
							<Street/>
							<ZipCode/>
							<CountryCode/>
							<StateCode/>
							<CountryOfLegalRegistration/>
						</PartyAddress>
					</Party>
				</SellerParty>
				<TermOfDelivery/>
         </arg0>
         </ws:applyTax>
   </soap:Body>
</soap:Envelope>